### Задание 2.3
Напишите функцию delete_columns(df, col=[]), которая удаляет столбцы из DataFrame и возвращает новую таблицу. Если одного из указанных столбцов не существует в таблице, то функция должна возвращать None. Удалите выбранные вами столбцы из таблицы customer_df.

In [16]:
import pandas as pd

def delete_columns(df, col=[]):
    for i in col:
        if i in df.columns:
            df.drop(i,axis=1,inplace=True)
        else: return None
    return df

# Напишите функцию delete_columns(df, col=[]), которая удаляет столбцы из DataFrame и возвращает новую таблицу. 
# Если одного из указанных столбцов в таблице не существует, то функция должна возвращать None.

if __name__ == '__main__':
    customer_df = pd.DataFrame({
        'number': [0, 1, 2, 3, 4],
        'cust_id': [128, 1201, 9832, 4392, 7472],
        'cust_age': [13, 21, 19, 21, 60],
        'cust_sale': [0, 0, 0.2, 0.15, 0.3],
        'cust_year_birth': [2008, 2000, 2002, 2000, 1961],
        'cust_order': [1400, 14142, 900, 1240, 8430]
    })
    columns_for_delete= ['number','cust_year_birth'] #выбранные вами столбцы
    new_df = delete_columns(customer_df, columns_for_delete)
    print(new_df)

   cust_id  cust_age  cust_sale  cust_order
0      128        13       0.00        1400
1     1201        21       0.00       14142
2     9832        19       0.20         900
3     4392        21       0.15        1240
4     7472        60       0.30        8430

### Задание 2.4
Задан DataFrame countries_df, содержащий следующие столбцы: название страны, население (population) в миллионах человек и площадь страны (square) в квадратных километрах.

countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]})

Рассчитайте среднюю плотность населения представленных стран (количество человек на квадратный километр)

In [33]:
import pandas as pd
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]})
countries_df['density'] = countries_df['population'] / countries_df['square'] *1000000
countries_df['density'].mean()

84.93080566562

### Задания 3.4 - 3.5
Вам представлены данные (в формате csv) об отчётах очевидцев НЛО в США за период с 1930 по 2020 год.

В данных есть следующие признаки:

        "City" — город, где был замечен НЛО;
        "Colors Reported" — цвет объекта;
        "Shape Reported" — форма объекта;
        "State" — обозначение штата;
        "Time" — время, когда был замечен НЛО (данные отсортированы от старых наблюдений к новым). 

Прочитайте данные, сделайте преобразование времени к формату datetime и выполните задания:
        
        3.4 В каком году отмечается наибольшее количество случаев наблюдения НЛО в США?
        3.5 Найдите средний интервал времени (в днях) между двумя последовательными случаями наблюдения НЛО в штате Невада (NV).

In [3]:
import pandas as pd

ufos = pd.read_csv('data/ufo.csv', sep=',')
ufos.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [11]:
ufos['Time'] = pd.to_datetime(ufos['Time'])
ufos.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [13]:
ufos['Year']=ufos['Time'].dt.year
ufos.head()

,City,Colors Reported,Shape Reported,State,Time,Year
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,1930
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,1930
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,1931
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,1931
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,1933

In [16]:
ufos['Year'].mode()[0]

1999

In [17]:
ufos['Date']=ufos['Time'].dt.date
ufos.head()

,City,Colors Reported,Shape Reported,State,Time,Year,Date
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,1930,1930-06-01
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,1930,1930-06-30
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,1931,1931-02-15
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,1931,1931-06-01
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,1933,1933-04-18

In [64]:
delta_days = ufos[ufos['State'] == 'NV']['Date'].diff(periods=1)
delta_days_days=delta_days.dt.days
display(delta_days_days.mean())

68.92932862190813

### Задание 4.4
Представьте, что вы занимаетесь подготовкой данных о вакансиях с платформы hh.ru. В вашем распоряжении имеется таблица, в которой с помощью парсинга собраны резюме кандидатов. В этой таблице есть текстовый столбец «Опыт работы». Пример такого столбца представлен ниже в виде объекта Series. Структура текста в столбце фиксирована и не может измениться.

Напишите функцию get_experience(arg), аргументом которой является строка столбца с опытом работы. Функция должна возвращать опыт работы в месяцах. Не забудьте привести результат к целому числу.

In [35]:
import pandas as pd
import numpy as np

def get_experience(arg):   
    # Напишите функцию get_experience(arg), аргументом которой является строка столбца с опытом работы. 
    # Функция должна возвращать опыт работы в месяцах. Не забудьте привести результат к целому числу.
    exp = arg.split(' ')
    # if exp[-1] == 'лет' or exp[-1] == 'год' or exp[-1] == 'года':
    if exp[-1] in ['год','года','лет']:
        # понадобилось преобразование: изменение типа данных в int, т.к. изначально был str
        return np.int16(exp[-2])*12
    # if exp[-3] == 'лет' or exp[-3] == 'год' or exp[-3] == 'года':
    if exp[-3] in ['год','года','лет']:
        return np.int16(exp[-4])*12 + np.int16(exp[-2])
    else: return np.int16(exp[-2])
    

if __name__ == '__main__':
    experience_col = pd.Series([
        'Опыт работы 8 лет 3 месяца',
        'Опыт работы 3 года 5 месяцев',
        'Опыт работы 1 год 9 месяцев',
        'Опыт работы 3 месяца',
        'Опыт работы 6 лет'
        ])
    experience_month = experience_col.apply(get_experience)
    
    print(experience_month)

0    99
1    41
2    21
3     3
4    72
dtype: int64

### Задание 6.1 - 6.11
Проанализируйте и преобразуйте данные о велопоездках клиентов компании Citi Bike (США), специализирующейся на прокате велосипедов (citibike-tripdata.csv).

    6.1 Сколько пропусков в столбце start station id?
    6.2 Какой тип данных имеют столбцы starttime и stoptime?
    6.3 Найдите идентификатор самой популярной стартовой стоянки. Запишите идентификатор в виде целого числа.
    6.4 Велосипед с каким идентификатором является самым популярным?
    6.5 Какой тип клиентов (столбец usertype) является преобладающим — Subscriber или Customer? В качестве ответа запишите долю клиентов преобладающего типа среди общего количества клиентов.
    6.6 Кто больше занимается велоспортом — мужчины или женщины (число поездок).
    6.7 Число уникальных стартовых и конечных стоянок, которыми воспользовались клиенты; минимальный возраст клиента; cамая непопулярная стартовой стоянка; стоянка, на которой завершается наибольшее количество поездок
    6.8 Удалите дублирующие признаки идентификаторов стоянок.
    6.9 Замените признак birth year на более понятный признак возраста клиента age. Годом отсчёта возраста выберите 2018 год. Столбец birth year удалите из таблицы. Сколько поездок совершено клиентами старше 60 лет?
    6.10 Создайте признак длительности поездки trip duration. Для этого вычислите интервал времени между временем окончания поездки (stoptime) и временем её начала (starttime) в секундах. В качестве ответа запишите среднюю длительность поездки в секундах
    6.11 Создайте «признак-мигалку» weekend, который равен 1, если поездка начиналась в выходной день (суббота или воскресенье), и 0 — в противном случае. Выясните, сколько поездок начиналось в выходные
    6.12 Создайте признак времени суток поездки time_of_day. Время суток будем определять из часа начала поездки. Условимся, что:
        - поездка совершается ночью (night), если её час приходится на интервал от 0 (включительно) до 6 (включительно) часов;
        - поездка совершается утром (morning), если её час приходится на интервал от 6 (не включительно) до 12 (включительно) часов;
        - поездка совершается днём (day), если её час приходится на интервал от 12 (не включительно) до 18 (включительно) часов;
        - поездка совершается вечером (evening), если её час приходится на интервал от 18 (не включительно) до 23 часов (включительно).
    Во сколько раз количество поездок, совершённых днём, больше, чем количество поездок, совёршенных ночью, за представленный в данных период времени?

In [39]:
import pandas as pd

citibike = pd.read_csv('data/citibike-tripdata.csv', sep=',')
citibike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 14 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   starttime                300000 non-null  object
 1   stoptime                 300000 non-null  object
 2   start station id         299831 non-null  float64
 3   start station name       299831 non-null  object
 4   start station latitude   300000 non-null  float64
 5   start station longitude  300000 non-null  float64
 6   end station id           299831 non-null  float64
 7   end station name         299831 non-null  object
 8   end station latitude     300000 non-null  float64
 9   end station longitude    300000 non-null  float64
 10  bikeid                   300000 non-null  int64
 11  usertype                 300000 non-null  object
 12  birth year               300000 non-null  int64
 13  gender                   300000 non-null  int64
dtypes: float64(6), int64(3), object(5)
memory usage: 32.0+ MB

In [41]:
citibike['start station id'].mode()[0]

281.0

In [42]:
citibike['bikeid'].mode()[0]

33887

In [44]:
citibike['usertype'].value_counts(normalize=True)

Subscriber    0.774007
Customer      0.225993
Name: usertype, dtype: float64

In [45]:
citibike['gender'].value_counts()

1    183582
2     74506
0     41912
Name: gender, dtype: int64

In [47]:
display(citibike['start station id'].nunique())
display(citibike['end station id'].nunique())

759

765

In [49]:
2022-citibike['birth year'].max()

20

In [50]:
citibike['start station name'].value_counts()

Grand Army Plaza & Central Park S    1928
Central Park S & 6 Ave               1909
Pershing Square North                1873
12 Ave & W 40 St                     1845
West St & Chambers St                1835
                                     ...
NYCBS Depot - GOW                      15
Franklin Ave & Empire Blvd             11
Railroad Ave & Kay Ave                  9
47 Ave & Skillman Ave                   7
Eastern Pkwy & Washington Ave           6
Name: start station name, Length: 759, dtype: int64

In [51]:
citibike['end station name'].mode()

0    West St & Chambers St
dtype: object

In [52]:
citibike = citibike.drop('start station id', axis=1)
citibike = citibike.drop('end station id', axis=1)

In [53]:
citibike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 12 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   starttime                300000 non-null  object
 1   stoptime                 300000 non-null  object
 2   start station name       299831 non-null  object
 3   start station latitude   300000 non-null  float64
 4   start station longitude  300000 non-null  float64
 5   end station name         299831 non-null  object
 6   end station latitude     300000 non-null  float64
 7   end station longitude    300000 non-null  float64
 8   bikeid                   300000 non-null  int64
 9   usertype                 300000 non-null  object
 10  birth year               300000 non-null  int64
 11  gender                   300000 non-null  int64
dtypes: float64(4), int64(3), object(5)
memory usage: 27.5+ MB

In [54]:
citibike['age'] = 2018 - citibike['birth year']

In [55]:
citibike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 13 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   starttime                300000 non-null  object
 1   stoptime                 300000 non-null  object
 2   start station name       299831 non-null  object
 3   start station latitude   300000 non-null  float64
 4   start station longitude  300000 non-null  float64
 5   end station name         299831 non-null  object
 6   end station latitude     300000 non-null  float64
 7   end station longitude    300000 non-null  float64
 8   bikeid                   300000 non-null  int64
 9   usertype                 300000 non-null  object
 10  birth year               300000 non-null  int64
 11  gender                   300000 non-null  int64
 12  age                      300000 non-null  int64
dtypes: float64(4), int64(4), object(5)
memory usage: 29.8+ MB

In [56]:
citibike = citibike.drop('birth year', axis=1)

In [57]:
citibike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 12 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   starttime                300000 non-null  object
 1   stoptime                 300000 non-null  object
 2   start station name       299831 non-null  object
 3   start station latitude   300000 non-null  float64
 4   start station longitude  300000 non-null  float64
 5   end station name         299831 non-null  object
 6   end station latitude     300000 non-null  float64
 7   end station longitude    300000 non-null  float64
 8   bikeid                   300000 non-null  int64
 9   usertype                 300000 non-null  object
 10  gender                   300000 non-null  int64
 11  age                      300000 non-null  int64
dtypes: float64(4), int64(3), object(5)
memory usage: 27.5+ MB

In [66]:
citibike[citibike['age']>60].count()[0]

11837

In [75]:
citibike['stoptime'] = pd.to_datetime(citibike['stoptime'])
citibike['starttime'] = pd.to_datetime()
citibike['trip duration'] = citibike['stoptime'] - citibike['starttime']
citibike['trip duration'].dt.seconds.mean()

999.9145033333333

In [93]:
def weekend_f(day):
    if day in [5,6]:
        return 1
    else: return 0

citibike['weekend'] = citibike['starttime'].dt.dayofweek.apply(weekend_f)
citibike['weekend'].sum()

115135

In [98]:
def daytime(hours):
    if hours in range(7): return 'night'
    if hours in range(7,13): return 'morning'
    if hours in range(13,19): return 'day'
    else: return 'evening'
    
citibike['time_of_day'] = citibike['starttime'].dt.hour.apply(daytime)

In [102]:
citibike[citibike['time_of_day'] == 'day'].count()[0] / citibike[citibike['time_of_day'] == 'night'].count()[0]

9.480411004308916